; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v2 ?v5)
             (pred_12 ?v10 ?v7)
             (pred_5 ?v2 ?v7)
             (pred_11 ?v9 ?v2 )
	     (pred_1 ?v2)
             (pred_8 ?v4)
             (pred_10 ?v10)
             (pred_6 ?v7)
             (pred_4 ?v2)
             (pred_2 ?v10)
             (pred_9 ?v2)
             (pred_7 ))



(:action op_3
:parameters (?v12 ?v8 ?v6 ?v13)
:precondition (and (pred_8 ?v12) (pred_8 ?v8) (pred_10 ?v6) (pred_6 ?v13)
          (pred_3 ?v12 ?v8) (pred_12 ?v6 ?v13)
                   (pred_5 ?v8 ?v13) (pred_1 ?v12) 
                   (pred_4 ?v8) (pred_2 ?v6))
:effect (and  (pred_9 ?v8) (not (pred_4 ?v8))))


(:action op_5
:parameters (?v12 ?v3)
:precondition (and (pred_8 ?v12) (pred_8 ?v3)
               (pred_1 ?v12) (pred_3 ?v12 ?v3) (pred_9 ?v3))
:effect (and (pred_1 ?v3) (not (pred_1 ?v12))))

(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_8 ?v12) (pred_10 ?v6) 
                  (pred_1 ?v12) (pred_11 ?v6 ?v12) (pred_7 ))
:effect (and (pred_2 ?v6)
   (not (pred_11 ?v6 ?v12)) (not (pred_7 ))))


(:action op_1
:parameters (?v12 ?v1 ?v11)
:precondition (and (pred_8 ?v12) (pred_10 ?v1) (pred_10 ?v11)
                  (pred_1 ?v12) (pred_2 ?v11) (pred_11 ?v1 ?v12))
:effect (and (pred_2 ?v1) (pred_11 ?v11 ?v12)
        (not (pred_2 ?v11)) (not (pred_11 ?v1 ?v12))))

(:action op_2
:parameters (?v12 ?v6)
:precondition (and (pred_8 ?v12) (pred_10 ?v6) 
                  (pred_1 ?v12) (pred_2 ?v6))
:effect (and (pred_7 ) (pred_11 ?v6 ?v12) (not (pred_2 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_14 obj_15 obj_21 obj_02 obj_17 obj_18 obj_03 obj_20 obj_10 obj_08 obj_05 obj_13 obj_16 obj_06 obj_04
    obj_07 obj_19
    obj_12 obj_01 obj_09
    )

    (:init
       (pred_7)

       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_17)
       (pred_8 obj_18)
       (pred_8 obj_03)
       (pred_8 obj_20)
       (pred_8 obj_10)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_06)
       (pred_8 obj_04)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_10 obj_12)
       (pred_10 obj_01)
       (pred_10 obj_09)

       (pred_3 obj_11 obj_02)
       (pred_3 obj_11 obj_14)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_15)
       (pred_3 obj_14 obj_11)
       (pred_3 obj_15 obj_18)
       (pred_3 obj_15 obj_21)
       (pred_3 obj_15 obj_14)
       (pred_3 obj_21 obj_03)
       (pred_3 obj_21 obj_15)
       (pred_3 obj_02 obj_20)
       (pred_3 obj_02 obj_17)
       (pred_3 obj_02 obj_11)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_18)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_02)
       (pred_3 obj_18 obj_08)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_15)
       (pred_3 obj_18 obj_17)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_03 obj_21)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_20 obj_13)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_10 obj_08)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_08 obj_05)
       (pred_3 obj_08 obj_18)
       (pred_3 obj_08 obj_10)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_08)
       (pred_3 obj_13 obj_16)
       (pred_3 obj_13 obj_20)
       (pred_3 obj_16 obj_06)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_16 obj_13)
       (pred_3 obj_06 obj_04)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_06 obj_16)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_06)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_02)
       (pred_5  obj_13 obj_07)
       (pred_5  obj_18 obj_19)
       (pred_5  obj_02 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_14)
       (pred_9 obj_15)
       (pred_9 obj_21)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_20)
       (pred_9 obj_10)
       (pred_9 obj_08)
       (pred_9 obj_05)
       (pred_9 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_04)

       (pred_12  obj_12 obj_07)
       (pred_12  obj_01 obj_19)
       (pred_12  obj_09 obj_19)
       (pred_11 obj_12 obj_20)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_09 obj_20)
       (pred_1 obj_21)
    )

    (:goal (and
       (pred_11 obj_12 obj_03)
       (pred_11 obj_09 obj_15)
    ))
(:constraints
  (always (not (pred_1 obj_17)))
)
)

; plan
1. (op_4 obj_21 obj_01)
   deleted: (pred_11 obj_01 obj_21) (pred_7)
   added: (pred_2 obj_01)
   goals met: 0 of 2
2. (op_5 obj_21 obj_03)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_3 obj_03 obj_18 obj_01 obj_19)
   deleted: (pred_4 obj_18)
   added: (pred_9 obj_18)
   goals met: 0 of 2
4. (op_2 obj_03 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_7) (pred_11 obj_01 obj_03)
   goals met: 0 of 2
5. (op_5 obj_03 obj_18)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_18)
   goals met: 0 of 2
6. (op_5 obj_18 obj_08)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_08)
   goals met: 0 of 2
7. (op_5 obj_08 obj_10)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_10)
   goals met: 0 of 2
8. (op_5 obj_10 obj_20)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_20)
   goals met: 0 of 2
9. (op_4 obj_20 obj_09)
   deleted: (pred_11 obj_09 obj_20) (pred_7)
   added: (pred_2 obj_09)
   goals met: 0 of 2
10. (op_5 obj_20 obj_10)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_10)
   goals met: 0 of 2
11. (op_5 obj_10 obj_08)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_08)
   goals met: 0 of 2
12. (op_5 obj_08 obj_18)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_18)
   goals met: 0 of 2
13. (op_5 obj_18 obj_15)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_15)
   goals met: 0 of 2
14. (op_2 obj_15 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_7) (pred_11 obj_09 obj_15)
   goals met: 1 of 2
15. (op_5 obj_15 obj_18)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_18)
   goals met: 1 of 2
16. (op_5 obj_18 obj_08)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_08)
   goals met: 1 of 2
17. (op_5 obj_08 obj_10)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_10)
   goals met: 1 of 2
18. (op_5 obj_10 obj_20)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_20)
   goals met: 1 of 2
19. (op_4 obj_20 obj_12)
   deleted: (pred_11 obj_12 obj_20) (pred_7)
   added: (pred_2 obj_12)
   goals met: 1 of 2
20. (op_5 obj_20 obj_10)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_10)
   goals met: 1 of 2
21. (op_5 obj_10 obj_08)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_08)
   goals met: 1 of 2
22. (op_5 obj_08 obj_18)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_18)
   goals met: 1 of 2
23. (op_5 obj_18 obj_03)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_03)
   goals met: 1 of 2
24. (op_1 obj_03 obj_01 obj_12)
   deleted: (pred_2 obj_12) (pred_11 obj_01 obj_03)
   added: (pred_2 obj_01) (pred_11 obj_12 obj_03)
   goals met: 2 of 2
